tutorials/fsiFoam/hronTurek/fsi3rans/constant/solid/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
   (248.9898 190 0)     //0=12
   (600 190 0)          //1=14
   (600 210 0)          //2=20
   (248.9898 210 0)     //3=18

   (248.9898 190 15)     //4=44
   (600 190 15)          //5=46
   (600 210 15)          //6=52
   (248.9898 210 15)     //7=50
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (105 6 1) simpleGrading (1 1 1)
);

edges
(
);

patches
(
     patch plateFix
     (
         (3 7 4 0)
     )

     patch plate
     (
      (3 2 6 7)
      (6 2 1 5)
      (1 0 4 5)
     )

     empty frontAndBackPlanes
     (
	 (0 1 2 3)
	 (7 6 5 4)
     )

);

mergePatchPairs
(
);

// ************************************************************************* //
